# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках
# не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает,
# что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются
# друг от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”,
# если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
# используйте split()

"""
def vowel_count(phrase):
    vowels = set("уеаояию")
    return len(list(filter(lambda letter: letter in vowels, phrase)))


phrases = input("Стих: ").split()
if len(set(map(vowel_count, phrases))) == 1:
    print("Парам пам-пам")
else:
    print("Пам парам")
"""

# Задача 36. Создайте список из случайных чисел. Найдите количество различных элементов в нем.
"""
from random import randint

rnd_lst = [randint(0, 100) for i in range(20)]
print(rnd_lst)
print(f"Количество различных элементов: {len(set(rnd_lst))}")
"""